package main

import "fmt"

func main() {

	c := make(chan int)
	c <- 42

	fmt.Println(<-c)
}

/*เกิดขึ้นอะไรขึ้นในโค้ดนี้?
โปรแกรมทำงานที่ main goroutine เดียว

เมื่อถึงบรรทัด c <- 42 ตัว Go runtime จะ สั่งให้ main ยืนรอ จนกว่าจะมีใครมาดึงเลข 42 ออกไป

แต่ตัวที่จะดึงเลข 42 ออกไป (fmt.Println(<-c)) อยู่ในบรรทัดถัดไป ซึ่ง main ยังไปไม่ถึงเพราะติดรออยู่ที่บรรทัดก่อนหน้า

ผลลัพธ์คือไม่มีใครส่งและไม่มีใครรับ โปรแกรมเลยเกิด Deadlock:
fatal error: all goroutines are asleep - deadlock!

Unbuffered Channel เหมือน การส่งของแบบยื่นให้กันมือต่อมือ
คนส่งจะยืนถือของค้างไว้ ออกไปไหนไม่ได้ จนกว่าจะมีคนมารับไปจากมือ
คนรับก็ต้องมารอรับ ยืนเฉย ๆ ทำอะไรไม่ได้ จนกว่าจะมีคนเอาของมายื่นให้
ทั้งคู่ต้องมาเจอกัน ณ เวลาเดียวกันพอดี (Synchronous)


Buffered Channel (แบบมีบัฟเฟอร์) เหมือน การเอาของไปใส่ตู้ล็อกเกอร์
คนส่งเอาของใส่ตู้ไว้แล้วเดินไปทำอย่างอื่นต่อได้เลย ไม่ต้องรอเจอคนรับ
คนรับค่อยมาเปิดตู้หยิบทีหลังเมื่อไหร่ก็ได้ (ตราบใดที่ตู้ไม่เต็มหรือตู้ไม่ว่าง)


*/
