package main

import "fmt"

func main() {

	var answer1, answer2, answer3 string

	fmt.Print("Name: ")
	_, err := fmt.Scan(&answer1)
	if err != nil {
		panic(err)
	}

	fmt.Print("Fav food :")
	_, err = fmt.Scan(&answer2)
	if err != nil {
		panic(err)
	}

	fmt.Print("Fav Sport :")
	_, err = fmt.Scan(&answer3)
	if err != nil {
		panic(err)
	}

	fmt.Println(answer1, answer2, answer3)
}

/*
panic ในภาษา Go คือ กลไกการหยุดการทำงานของโปรแกรมอย่างกะทันหัน
เมื่อเกิดข้อผิดพลาดร้ายแรงเกินกว่าที่โปรแกรมจะทำงานต่อไปได้ ( runtime error)

เปรียบเทียบง่ายๆ panic ก็เหมือนกับ Exceptions หรือการ throw error ในภาษาอื่นๆ
(เช่น Java, Python, JavaScript) เพียงแต่ Go ออกแบบมาให้เราใช้ panic
เฉพาะเหตุการณ์ที่ร้ายแรงจริงๆ ไม่ใช่ข้อผิดพลาดทั่วไป


1. ลักษณะการทำงานเมื่อเกิด panic
	เมื่อโปรแกรมสั่ง panic:

	ฟังก์ชันปัจจุบันจะ หยุดทำงานทันที

	Go จะเคลียร์ทรัพยากรด้วยการรันฟังก์ชันที่ถูกเลื่อนไว้ด้วย defer ทั้งหมดในฟังก์ชันนั้น
	จากนั้นจะย้อนกลับไปยังฟังก์ชันที่เรียกมา (Caller) แล้วสั่ง defer ของฟังก์ชันนั้นต่อ ทำซ้ำไปเรื่อยๆ จนถึงฟังก์ชัน main
	หากไม่มีการกู้คืน (Recover) โปรแกรมจะ Crash (เด้งดับ) พร้อมพิมพ์ข้อความความผิดพลาดและ Stack Trace ออกมา

2. panic เกิดขึ้นได้จาก 2 กรณี

	2.1 เกิดจากระบบ runtime ของ Go เอง (Built-in Panic)
	    เช่น การเข้าถึง Index ของ Slice ที่ไม่มีอยู่จริง หรือการอ้างอิง Pointer ที่เป็น nil

	package main

	func main() {
    	arr := []int{1, 2, 3}
    	println(arr[5]) // เกิด panic: runtime error: index out of range [5] with length 3
	}

	2.2 เกิดจากการสั่งเองในโค้ด (Explicit Panic)
		ผู้เขียนโค้ดสั่งให้หยุดโปรแกรมเองเมื่อเจอเงื่อนไขที่รับไม่ได้

	package main

	import "fmt"

	func main() {
		age := -5
		if age < 0 {
			panic("อายุติดลบไม่ได้!") // สั่ง panic พร้อมส่งข้อความแจ้งเตือน
		}
		fmt.Println("Age:", age)
	}

3. ควรใช้ panic เมื่อไหร่?
ในภาษา Go มีปรัชญาชัดเจนว่า "อย่าใช้ panic สำหรับข้อผิดพลาดทั่วไป"

	ควรใช้ panic 🛑
	ความเสียหายระดับระบบ/โครงสร้าง:
	เช่น อ่านไฟล์คอนฟิกหลักของเซิร์ฟเวอร์ไม่เจอเมื่อเริ่มโปรแกรม
	(ถ้าไม่มีไฟล์นี้ โปรแกรมก็ทำงานไม่ได้อยู่ดี)

	เกิด bug ในระดับที่ไม่ควรเกิดขึ้นเลย:
	 เช่น โค้ดหลุดเข้ามาในจุดที่เป็นไปไม่ได้ตาม logic

	----------------------------------------------------


	ไม่ควรใช้ panic (ให้ใช้ error แทน) ⚠️
	ข้อผิดพลาดจากการใช้งาน: เช่น ผู้ใช้พิมพ์รหัสผ่านผิด, กรอกข้อมูลไม่ครบ

	ปัญหาการเชื่อมต่อภายนอก: เช่น ต่อ Database ไม่ติด,
	 ต่อ API ภายนอกล้มเหลว (ควรคืนค่า error แล้ว retry)

*/
