package main

import (
	"fmt"
	"log"
	"os"
)

func main() {
	defer foo()
	_, err := os.Open("no-file.txt")
	if err != nil {
		log.Fatalln(err)
	}
}

func foo() {
	fmt.Println("When os.Exits() is called, deffered functions don't run")
}

/*
log.Fatalln คือฟังก์ชันสำหรับการบันทึก Log และ สั่งเลิกทำงานทันที โดยมีการทำงาน 2 ขั้นตอนติดต่อกัน:

	1. พิมพ์ข้อความ Log ออกมาพร้อมระบุ วัน/เวลา (Timestamp) ปัจจุบัน (คล้ายกับ log.Println)
	2. สั่งจบโปรแกรมทันที ด้วยการเรียกคำสั่ง os.Exit(1)



ข้อแตกต่างสำคัญที่ต้องระวัง: log.Fatalln vs panic

หลายคนมักสับสนระหว่าง log.Fatalln กับ panic เพราะส่งผลให้โปรแกรมหยุดรันเหมือนกัน แต่มีจุดต่างกันที่สำคัญมาก:

log.Fatalln
การทำงานของ defer: ไม่ทำงานเลย! (บายพาสข้าม defer ทั้งหมด)
การ Recover: ไม่สามารถกู้คืนได้
ระดับความรุนแรง: ร้ายแรงที่สุด หยุดโปรแกรมทันทีทันใด


panic
การทำงานของ defer: ยังคงทำงาน (จะทยอยรัน defer ก่อนปิด)
การ Recover: สามารถดักจับเพื่อกู้คืนได้ด้วย recover()
ระดับความรุนแรง: เกิดสภาวะ Exception ในการรัน


⚠️ ข้อควรระวัง:
เนื่องจาก log.Fatalln จะเรียก os.Exit(1) โดยตรง ทำให้ฟังก์ชันที่ลงทะเบียนไว้ด้วย
defer จะถูกข้ามและไม่ทำงาน ดังนั้นหากมีงานสำคัญที่ต้องทำก่อนปิดโปรแกรม เช่น
การบันทึกสถานะลง Database หรือการคืนทรัพยากร ไม่ควรใช้


ควรใช้ log.Fatalln เมื่อไหร่?
ควรใช้เฉพาะในกรณีที่ โปรแกรมไม่สามารถเริ่มต้นหรือทำงานต่อได้แล้วจริงๆ เท่านั้น เช่น:
	อ่านไฟล์ Config หลักไม่เจอเมื่อเริ่มโปรแกรม (Startup)
	เชื่อมต่อ Database หลักในขั้นตอนเปิดเซิร์ฟเวอร์ไม่สำเร็จ
*/
